load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://api.alchemyunbound.net
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 2500
  ensure:
      thresholds:
        - http.response_time.p99: 2500
        - http.response_time.p95: 2000
scenarios:
  - flow:
      - loop:
        - get:
            url: "/api?a=brick&b=sheep"
        - get:
            url: "/api?a=plant&b=forest"
        - get:
            url: "/api?a=planet&b=water"
        - get:
            url: "/api?a=infernofire&b=time"
        count: 100